app/views/posts/index.html.erb

SELECT COUNT(*) FROM "likes"  WHERE "likes"."post_id" = ?  [["post_id", 1]]
---
			<a href="/likes/destroy/<%= post.id %>" class="btn btn-danger">Delete your post</a>
			<a href="/posts/show/<%= post.id %>"> <%= post.likes.count %> people like this</a>