app/controllers/likes_controller.rb

	def create
		Like.create(user: User.find(session[:user_id]), post:Post.find(params[:id]))
---
INSERT INTO "likes" ("created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-09-03 01:57:49.076458"], ["post_id", 2], ["updated_at", "2015-09-03 01:57:49.076458"], ["user_id", 3]]
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]