app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users"  WHERE "users"."id" IN (1)
---
  def index
 	@posts = Post.includes(:user)

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "likes".* FROM "likes"  WHERE "likes"."post_id" = ?  [["post_id", 2]]
---
  def show

  	@post = Post.includes(:user).find(params[:id])
  	@postInfo = Post.find(params[:id]).likes.preload(:user, :post)

INSERT INTO "posts" ("created_at", "post", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-09-03 01:55:22.145320"], ["post", "Create an app that will disrupt the transportation sector"], ["updated_at", "2015-09-03 01:55:22.145320"], ["user_id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
  	User.find(session[:user_id]).post.create(post_params)