app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT COUNT(*) FROM "posts" INNER JOIN "likes" ON "posts"."id" = "likes"."post_id" WHERE "likes"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "likes"  WHERE "likes"."user_id" = ?  [["user_id", 3]]
---
	def show
		@current_user = User.find(params[:id])
		@postCounter = User.find(params[:id]).post.count
		@likesCounter = User.find(params[:id]).likes.count

INSERT INTO "users" ("created_at", "email", "encrypted_password", "first_name", "last_name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)

		if @user.save